-- =============================================================
-- SẢN PHẨM TỰ HỌC : HỆ THỐNG TOUR DU LICH
-- TEAM THỰC HIỆN : DPV TEAM
-- NGUYỄN CỬU THÀNH ĐẠT - PHAN HÀ MINH PHÚC - VĂN QUÝ VƯƠNG 
-- =============================================================
DROP DATABASE IF EXISTS DPV_TOURDULICH;
CREATE DATABASE DPV_TOURDULICH CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci;
USE DPV_TOURDULICH;
-- -------------------------------------------------------------
-- BƯỚC 1: TẠO CẤU TRÚC BẢNG (CREATE TABLES)
-- -------------------------------------------------------------


-- -------------------------------------------------------------
-- BƯỚC 2: THIẾT LẬP RÀNG BUỘC (ALTER TABLE)
-- -------------------------------------------------------------


-- -------------------------------------------------------------
-- BƯỚC 3: THIẾT LẬP KHÓA NGOẠI (FOREIGN KEYS)
-- -------------------------------------------------------------


-- =============================================================
-- CÁC CÂU LỆNH TRUY VẤN (SELECT) KIỂM TRA HỆ THỐNG
-- Phục vụ test logic và lấy số liệu 
-- =============================================================


-- =============================================================
-- BƯỚC 4 & 5: HÀM, THỦ TỤC, TRIGGER VÀ TEST 
-- =============================================================


